/*
 * (C) 2003-2006 Gabest
 * (C) 2006-2017 see Authors.txt
 *
 * This file is part of MPC-BE.
 *
 * MPC-BE is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 3 of the License, or
 * (at your option) any later version.
 *
 * MPC-BE is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 *
 */

#include "stdafx.h"
#include <thread>
#include "AboutDlg.h"
#include <Tlhelp32.h>
#include "MainFrm.h"
#include "Misc.h"
#include <winternl.h>
#include <psapi.h>
#include "Ifo.h"
#include "MultiMonitor.h"
#include "../../DSUtil/WinAPIUtils.h"
#include "../../DSUtil/SysVersion.h"
#include "../../DSUtil/FileHandle.h"
#include "../../DSUtil/FileVersionInfo.h"
#include <moreuuids.h>
#include <winddk/ntddcdvd.h>
#include <detours/detours.h>
#include <afxsock.h>
#include <atlsync.h>
#include <atlutil.h>
#include "UpdateChecker.h"

const LanguageResource CMPlayerCApp::languageResources[] = {
	{ID_LANGUAGE_ARMENIAN,				1067,	L"Armenian",				L"hy"},
	{ID_LANGUAGE_BASQUE,				1069,	L"Basque",					L"eu"},
	{ID_LANGUAGE_BELARUSIAN,			1059,	L"Belarusian",				L"by"},
	{ID_LANGUAGE_CATALAN,				1027,	L"Catalan",					L"ca"},
	{ID_LANGUAGE_CHINESE_SIMPLIFIED,	2052,	L"Chinese (Simplified)",	L"sc"},
	{ID_LANGUAGE_CHINESE_TRADITIONAL,	3076,	L"Chinese (Traditional)",	L"tc"},
	{ID_LANGUAGE_CZECH,					1029,	L"Czech",					L"cz"},
	{ID_LANGUAGE_DUTCH,					1043,	L"Dutch",					L"nl"},
	{ID_LANGUAGE_ENGLISH,				0,		L"English",					L"en"},
	{ID_LANGUAGE_FRENCH,				1036,	L"French",					L"fr"},
	{ID_LANGUAGE_GERMAN,				1031,	L"German",					L"de"},
	{ID_LANGUAGE_GREEK,					1032,	L"Greek",					L"el"},
	{ID_LANGUAGE_HEBREW,				1037,	L"Hebrew",					L"he"},
	{ID_LANGUAGE_HUNGARIAN,				1038,	L"Hungarian",				L"hu"},
	{ID_LANGUAGE_ITALIAN,				1040,	L"Italian",					L"it"},
	{ID_LANGUAGE_JAPANESE,				1041,	L"Japanese",				L"ja"},
	{ID_LANGUAGE_KOREAN,				1042,	L"Korean",					L"kr"},
	{ID_LANGUAGE_POLISH,				1045,	L"Polish",					L"pl"},
	{ID_LANGUAGE_PORTUGUESE_BR,			1046,	L"Portuguese (Brazil)",		L"br"},
	{ID_LANGUAGE_ROMANIAN,				1048,	L"Romanian",				L"ro"},
	{ID_LANGUAGE_RUSSIAN,				1049,	L"Russian",					L"ru"},
	{ID_LANGUAGE_SLOVAK,				1053,	L"Slovak",					L"sk"},
	{ID_LANGUAGE_SWEDISH,				1051,	L"Swedish",					L"sv"},
	{ID_LANGUAGE_SPANISH,				1034,	L"Spanish",					L"es"},
	{ID_LANGUAGE_TURKISH,				1055,	L"Turkish",					L"tr"},
	{ID_LANGUAGE_UKRAINIAN,				1058,	L"Ukrainian",				L"ua"},
};

const size_t CMPlayerCApp::languageResourcesCount = _countof(CMPlayerCApp::languageResources);

extern "C" {
	int mingw_app_type = 1;
}

typedef struct _PEB_FREE_BLOCK // Size = 8
{
	struct _PEB_FREE_BLOCK *Next;
	ULONG Size;
} PEB_FREE_BLOCK, *PPEB_FREE_BLOCK;

typedef void (*PPEBLOCKROUTINE)(PVOID);

// PEB (Process Environment Block) data structure (FS:[0x30])
// Located at addr. 0x7FFDF000

typedef struct _PEB_NT // Size = 0x1E8
{
	BOOLEAN				InheritedAddressSpace;			//000
	BOOLEAN				ReadImageFileExecOptions;		//001
	BOOLEAN				BeingDebugged;					//002
	BOOLEAN				SpareBool;						//003 Allocation size
	HANDLE				Mutant;							//004
	HINSTANCE			ImageBaseAddress;				//008 Instance
	PPEB_LDR_DATA		LdrData;						//00C
	PRTL_USER_PROCESS_PARAMETERS	ProcessParameters;	//010
	ULONG				SubSystemData;					//014
	HANDLE				ProcessHeap;					//018
	KSPIN_LOCK			FastPebLock;					//01C
	PPEBLOCKROUTINE		FastPebLockRoutine;				//020
	PPEBLOCKROUTINE		FastPebUnlockRoutine;			//024
	ULONG				EnvironmentUpdateCount;			//028
	PVOID *				KernelCallbackTable;			//02C
	PVOID				EventLogSection;				//030
	PVOID				EventLog;						//034
	PPEB_FREE_BLOCK		FreeList;						//038
	ULONG				TlsExpansionCounter;			//03C
	ULONG				TlsBitmap;						//040
	LARGE_INTEGER		TlsBitmapBits;					//044
	PVOID				ReadOnlySharedMemoryBase;		//04C
	PVOID				ReadOnlySharedMemoryHeap;		//050
	PVOID *				ReadOnlyStaticServerData;		//054
	PVOID				AnsiCodePageData;				//058
	PVOID				OemCodePageData;				//05C
	PVOID				UnicodeCaseTableData;			//060
	ULONG				NumberOfProcessors;				//064
	LARGE_INTEGER		NtGlobalFlag;					//068 Address of a local copy
	LARGE_INTEGER		CriticalSectionTimeout;			//070
	ULONG				HeapSegmentReserve;				//078
	ULONG				HeapSegmentCommit;				//07C
	ULONG				HeapDeCommitTotalFreeThreshold;	//080
	ULONG				HeapDeCommitFreeBlockThreshold;	//084
	ULONG				NumberOfHeaps;					//088
	ULONG				MaximumNumberOfHeaps;			//08C
	PVOID **			ProcessHeaps;					//090
	PVOID				GdiSharedHandleTable;			//094
	PVOID				ProcessStarterHelper;			//098
	PVOID				GdiDCAttributeList;				//09C
	KSPIN_LOCK			LoaderLock;						//0A0
	ULONG				OSMajorVersion;					//0A4
	ULONG				OSMinorVersion;					//0A8
	USHORT				OSBuildNumber;					//0AC
	USHORT				OSCSDVersion;					//0AE
	ULONG				OSPlatformId;					//0B0
	ULONG				ImageSubsystem;					//0B4
	ULONG				ImageSubsystemMajorVersion;		//0B8
	ULONG				ImageSubsystemMinorVersion;		//0BC
	ULONG				ImageProcessAffinityMask;		//0C0
	ULONG				GdiHandleBuffer[0x22];			//0C4
	ULONG				PostProcessInitRoutine;			//14C
	ULONG				TlsExpansionBitmap;				//150
	UCHAR				TlsExpansionBitmapBits[0x80];	//154
	ULONG				SessionId;						//1D4
	void *				AppCompatInfo;					//1D8
	UNICODE_STRING		CSDVersion;						//1DC
} PEB_NT, *PPEB_NT;

/////////////////////////////////////////////////////////////////////////////
// CMPlayerCApp

BEGIN_MESSAGE_MAP(CMPlayerCApp, CWinApp)
	//{{AFX_MSG_MAP(CMPlayerCApp)
	ON_COMMAND(ID_HELP_ABOUT, OnAppAbout)
	ON_COMMAND(ID_FILE_EXIT, OnFileExit)
	//}}AFX_MSG_MAP
	ON_COMMAND(ID_HELP_SHOWCOMMANDLINESWITCHES, OnHelpShowcommandlineswitches)
END_MESSAGE_MAP()

/////////////////////////////////////////////////////////////////////////////
// CMPlayerCApp construction

CMPlayerCApp::CMPlayerCApp()
	: m_bProfileInitialized(false)
	, m_bQueuedProfileFlush(false)
	, m_dwProfileLastAccessTick(0)
	, GetRemoteControlCode(GetRemoteControlCodeMicrosoft)
{
}

CMPlayerCApp::~CMPlayerCApp()
{
	// Wait for any pending I/O operations to be canceled
	while (WAIT_IO_COMPLETION == SleepEx(0, TRUE));
}

BOOL CMPlayerCApp::OnIdle(LONG lCount)
{
	BOOL ret = __super::OnIdle(lCount);
	if (!ret) {
		FlushProfile(false);
